In [2]:
import pandas as pd

In [5]:
#Q1
DATA=[4,8,15,16,23,42]
DF=pd.Series(DATA)
print(DF)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
#or Q1 CAN BE:-----
s = pd.Series([4,8,15,16,23,42],
              name="DATA")
s.to_frame()

   DATA
0     4
1     8
2    15
3    16
4    23
5    42

In [16]:
#Q2
DATA=[4,8,15,16,23,42,'EDFDF','FVDGR','BFGBDG','VERBRB']
DF=pd.Series(DATA)
DF

0         4
1         8
2        15
3        16
4        23
5        42
6     EDFDF
7     FVDGR
8    BFGBDG
9    VERBRB
dtype: object

In [14]:
#Q3
jay={'Name':['Alice','Bob','Claire'],
        'Age':[25,30,27],
        'Gender':['Female','Male','Female']}
df = pd.DataFrame(jay)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
#Q4
DataFrame: In pandas, a DataFrame is a 2-dimensional labeled data structure that can store data of different types (e.g., numerical, categorical, textual) in rows and columns, similar to a spreadsheet or SQL table.
A DataFrame consists of rows and columns, where each column can be thought of as a Series object

In [18]:
#Example (DataFrame):
jay={'Name':['Alice','Bob','Claire'],
        'Age':[25,30,27],
        'Gender':['Female','Male','Female']}
df = pd.DataFrame(jay)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Series: A Series is a 1-dimensional labeled array that can store homogeneous data of any type (e.g., integer, float, string, etc.). In other words, a Series is a single column of a DataFrame.

In [19]:
#Example (Series):
DATA=[4,8,15,16,23,42]
DF=pd.Series(DATA)
print(DF)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [23]:
#Q5
#Some of the commons functions that were discussed during today's lecture that can be used to manipulate data in Pandas are:

#1.df.head(n): In Pandas, df.head(n) is a method of a DataFrame object that returns the first n rows of the DataFrame
import numpy as np

data= {
    'Courses':["Spark","PySpark","Spark","Python","PySpark"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','30days', None,np.nan]
          }
    
df = pd.DataFrame(data)

In [24]:
df.head()

   Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days
2    Spark  23000   30days
3   Python  24000     None
4  PySpark  26000      NaN

In [25]:
df.head(2)

   Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days

In [26]:
#2.df.tail(n): In Pandas, df.tail(n) is a method of a DataFrame object that returns the last n rows of the DataFrame
df.tail()

   Courses    Fee Duration
0    Spark  22000   30days
1  PySpark  25000   50days
2    Spark  23000   30days
3   Python  24000     None
4  PySpark  26000      NaN

In [27]:
df.tail(2)

   Courses    Fee Duration
3   Python  24000     None
4  PySpark  26000      NaN

In [28]:
#3.df.columns: df.columns returns the column names of a dataframe
df.columns

Index(['Courses', 'Fee', 'Duration'], dtype='object')

In [29]:
#4.df.dtypes: returns the data type of all the columns in a dataframe
df.dtypes

Courses     object
Fee          int64
Duration    object
dtype: object

In [30]:
#5.df.shape: returns the number of rows and columns in the DataFrame.
df.shape

(5, 3)

In [31]:
#6.df.info(): prints a summary of the DataFrame, including the data types and non-null values of each column.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Courses   5 non-null      object
 1   Fee       5 non-null      int64
 2   Duration  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [32]:
#7.df[]: is not a pandas method, but it can be sued to access a single column from a datframe
df['Courses']

0      Spark
1    PySpark
2      Spark
3     Python
4    PySpark
Name: Courses, dtype: object

In [33]:
#8.df[[]]: is not a pandas method, but can be used to access multiple columns of a dataframe
df[['Courses', 'Fee']]

   Courses    Fee
0    Spark  22000
1  PySpark  25000
2    Spark  23000
3   Python  24000
4  PySpark  26000

In [ ]:
#Q6
Pandas Series, DataFrame and Panel all of them are mutable but panel has been deprecated and is no longer recommended for use

In [3]:
#Q7
s1 = pd.Series([1, 2, 3])
s2 = pd.Series(['a', 'b', 'c'])
s3 = pd.Series([10.5, 20.5, 30.5])

df = pd.DataFrame({'col1': s1, 'col2': s2, 'col3': s3})

df

   col1 col2  col3
0     1    a  10.5
1     2    b  20.5
2     3    c  30.5